In [ ]:
Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. 
    Определите какому фильму было выставлено больше всего оценок 5.0.

Задание 2
По данным файла power.csv посчитайте суммарное потребление 
стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 
за период с 2005 по 2010 года. 
Не учитывайте в расчетах отрицательные значения quantity.

Задание 3
Выберите страницу любого сайта с табличными данными. 
Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [ ]:
ЗАДАНИЕ 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. 
Определите какому фильму было выставлено больше всего оценок 5.0.

In [342]:
import pandas as pd

ratings = pd.read_csv('ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [343]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100004 entries, 0 to 100003
Data columns (total 4 columns):
userId       100004 non-null int64
movieId      100004 non-null int64
rating       100004 non-null float64
timestamp    100004 non-null int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [344]:
# сколько фильмов в коллекции
len(ratings.movieId.unique())

9066

In [347]:
len(ratings) # количество строк в базе

100004

In [337]:
%%time
# топ пользователей по количеству оценок
ratings.groupby('userId').count().sort_values('movieId', ascending=False).head()

CPU times: user 11.3 ms, sys: 5.32 ms, total: 16.6 ms
Wall time: 14.9 ms

        movieId  rating  timestamp
userId
547        2391    2391       2391
564        1868    1868       1868
624        1735    1735       1735
15         1700    1700       1700
73         1610    1610       1610

In [366]:
# статистика отличных оценок

ratings[ ratings.rating == 5.0 ].head()

    userId  movieId  rating  timestamp
21       2       17     5.0  835355681
22       2       39     5.0  835355604
29       2      150     5.0  835355395
37       2      222     5.0  835355840
44       2      265     5.0  835355697

In [358]:
# новый DataFrame 
otl = ratings[ ratings.rating == 5.0 ]

In [359]:
otl.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15095 entries, 21 to 99994
Data columns (total 4 columns):
userId       15095 non-null int64
movieId      15095 non-null int64
rating       15095 non-null float64
timestamp    15095 non-null int64
dtypes: float64(1), int64(3)
memory usage: 589.6 KB

In [360]:
# фильм № 318 имеет максимальное количество пятерок (170 шт) в этой выборке

otl.groupby('movieId').count().sort_values('rating', ascending=False).head()

         userId  rating  timestamp
movieId
318         170     170        170
296         138     138        138
260         122     122        122
527         109     109        109
858         107     107        107

In [361]:
# название фильма можно определить из файла movies.csv

movies = pd.read_csv('ml-latest-small/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [364]:
# сколько фильмов в коллекции
# в этом файле на 59 фильмов больше, чем в ratings. 
# но, если movieId уникальны для этих файлов, то все дб верно))))

len(movies.movieId.unique())-9066

59

In [362]:
# фильм № 318 в базе это Shawshank Redemption (в РФ - Побег из Шоушенка)

movies[movies.movieId == 318]

     movieId                             title       genres
284      318  Shawshank Redemption, The (1994)  Crime|Drama

In [ ]:
ЗАДАНИЕ 2
По данным файла power.csv посчитайте суммарное потребление 
стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 
за период с 2005 по 2010 года. 
Не учитывайте в расчетах отрицательные значения quantity.

In [273]:
import pandas as pd

In [274]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [275]:
# фильтр: страны Прибалтики, категории, годы
a = data[((data['country']=='Latvia')|
          (data['country']=='Lithuania')|
          (data['country']=='Estonia'))&
             ((data['category']==4)|
              (data['category']==12)|
              (data['category']==21)) & 
             ((data['year']>=2005)&(data['year']<=2010))]
a.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [280]:
print('суммарное потребление стран Прибалтики: ',sum(a[ a.quantity > 0.0 ]['quantity']))

суммарное потребление стран Прибалтики:  240580.0

                                  ПРИМЕЧАНИЕ
                           дополнительные проверки))))

In [277]:
a['category'].unique()

array([ 4, 12, 21])

In [278]:
a['country'].unique()

array(['Estonia', 'Lithuania', 'Latvia'], dtype=object)

In [279]:
a['year'].unique()

array([2008, 2007, 2006, 2005, 2010, 2009])

In [207]:
a['country'].value_counts().head(10)

Lithuania    220
Estonia       99
Latvia        92
Name: country, dtype: int64

In [211]:
a.shape # (количество строк и столбцов)

(411, 4)

In [271]:
# самый популярный способ
bb = a[ a.quantity < 0.0 ]
cc = a[ a.quantity > 0.0 ]
print(sum(cc['quantity'])+sum(bb['quantity']))
sum(a[ a.quantity > 0.0 ]['quantity'])

240481.0

240580.0

In [ ]:
ЗАДАНИИЕ 3
Выберите страницу любого сайта с табличными данными. 
Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [368]:
pd.read_html('https://fortrader.org/currencyrates',encoding='utf-8')

[    Код  Количество                 Название      RUB  Изменение
 0   USD           1               Доллар США  64.2101     0.0092
 1   EUR           1                     Евро  70.6761     0.0037
 2   CNY          10           Китайский юань  91.4674    -0.0364
 3   GBP           1          Фунт стерлингов  82.4458     0.0439
 4   TRY           1            Турецкая лира  11.1129    -0.0225
 5   TJS          10        Таджикский сомони  66.2069    -0.0137
 6   KZT         100      Казахстанский тенге  16.5309     0.0427
 7   PLN           1          Польский злотый  16.4532    -0.0348
 8   UAH          10        Украинская гривна  26.4834     0.0707
 9   BYN           1        Белорусский рубль  31.2458     0.0121
 10  JPY         100            Японская иена  59.0791     0.2547
 11  CZK          10            Чешская крона  27.6601     0.0302
 12  UZS       10000            Узбекский сум  67.5896    -0.0259
 13  CHF           1        Швейцарский франк  65.0097     0.2780
 14  KGS         100           Киргизский сом  91.9257     0.2004
 15  AMD         100           Армянский драм  13.4331     0.0019
 16  CAD           1         Канадский доллар  48.4203    -0.0040
 17  KRW        1000     Вон Республики Корея  54.8870    -0.0833
 18  AZN           1    Азербайджанский манат  37.8486     0.0055
 19  SEK          10           Шведская крона  65.9431     0.0947
 20  HUF         100        Венгерский форинт  21.1761     0.0782
 21  INR         100          Индийская рупия  89.2253    -0.2471
 22  NOK          10         Норвежская крона  69.8277     0.0107
 23  AUD           1     Австралийский доллар  43.6564    -0.2634
 24  BGN           1           Болгарский лев  36.1462     0.0377
 25  DKK          10            Датская крона  94.6145     0.0916
 26  SGD           1      Сингапурский доллар  47.1128    -0.0071
 27  RON           1            Румынский лей  14.8298     0.0049
 28  BRL           1         Бразильский реал  15.3988     0.0003
 29  TMT           1  Новый туркменский манат  18.3720     0.0026
 30  MDL          10           Молдавский лей  36.4571    -0.1246
 31  XDR           1                      СДР  88.1386    -0.0092
 32  ZAR          10     Южноафриканский рэнд  42.9407    -0.0217]

In [314]:
data_df = pd.read_html('https://fortrader.org/currencyrates', 
                        encoding='utf-8')[0]

In [315]:
data_df.head(7)

   Код  Количество             Название      RUB  Изменение
0  USD           1           Доллар США  64.2101     0.0092
1  EUR           1                 Евро  70.6761     0.0037
2  CNY          10       Китайский юань  91.4674    -0.0364
3  GBP           1      Фунт стерлингов  82.4458     0.0439
4  TRY           1        Турецкая лира  11.1129    -0.0225
5  TJS          10    Таджикский сомони  66.2069    -0.0137
6  KZT         100  Казахстанский тенге  16.5309     0.0427

In [316]:
type(data_df)

pandas.core.frame.DataFrame

In [317]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 5 columns):
Код           33 non-null object
Количество    33 non-null int64
Название      33 non-null object
RUB           33 non-null float64
Изменение     33 non-null float64
dtypes: float64(2), int64(1), object(2)
memory usage: 1.4+ KB